slides.org
#+TITLE: QML Tutorial
#+SUBTITLE: Better GUI with less effort
#+Author: Adam Washington
#+Date: 2023-06-28
#+SETUPFILE: ~/annex/slides/theme.org
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_THEME: dracula
#+REVEAL_INIT_OPTIONS: totalTime: 6300, plugins: [RevealNotes]
#+REVEAL_MULTIPLEX_ID: "bbebfa54fba8ab84"
#+REVEAL_MULTIPLEX_SECRET: "16878852250022031037"
#+REVEAL_MULTIPLEX_URL:  https://reveal-multiplex.glitch.me
#+OPTIONS:  toc:nil H:2

* Introduction

** QML

- A declarative method for defining GUIs
- Based on the Qt library
- Supports [[https://wiki.qt.io/Language_Bindings][over a dozen languages]].
- Declarative GUI, not imperative
- Divides code into a =model= and a =view=

#+BEGIN_NOTES
This repo is a tutorial set for understanding using QML with Python
for creating GUIs.  Python was chosen due to its status as a modern
/lingua franca/ of coding, but the concepts apply to [[https://wiki.qt.io/Language_Bindings][over a dozen
languages]].  In fact, the QML files allows changing the backend
implementation language without making any changes to the interface.

Through a series of alternating sections, we'll create a small data
analysis application.  We will attempt to alternate making changes to
the python and the QML to help emphasise the separation.
#+END_NOTES

** Model

- Performs detailed language and calculations
- Written in your favourite programming language
- Has *no knowledge* of the screen or window
- Only acts via =Properties=, =Signals=, and =Slots=

** Vocab

The Qt object model has a couple of pieces of vocab

  - Signal :: A message which may trigger actions from multiple parts of the application
  - Slot :: A routine that can be performed.  Can be connected to a signal
  - Property :: A value that can be read and optionally written.  May emit a signal when changed.

** View

- Describes the on screen display of the model
- Always written in QML
- Used to connect the Properties, Signals, and Slots of the models

** Why Bother?

- Code reuse
  - A model can have multiple views
  - A view can apply to multiple models
- Makes code easy to test
- Less bugs
- Shorter, more readable code
- No name litter

* Hello World

** Full Text

We'll start with the simplest possible QML example.

#+BEGIN_SRC js :tangle hello/view.qml :noweb yes
<<SimpleQMLImport>>

<<HelloContainer>>
#+END_SRC

** Imports

#+NAME:SimpleQMLImport
#+BEGIN_SRC js
import QtQuick 2.0
#+END_SRC

Every QML file starts with a set of imports.  You will always need to
import `QtQuick`, as it is the default QML library.  We'll encounter
more libraries as we continue.

** Widgets

#+NAME:HelloTextWidget
#+BEGIN_SRC js
Text {
  text: "Hello World!"
  anchors.centerIn: parent
}
#+END_SRC


- Widget type followed by curly bracket
- Attribute name, then colon, then value


** Anchors

- Describe constraints between edges of widgets
- Full control of positioning
- Lots of work

#+BEGIN_SRC js
Button {
  anchors.left: parent.left
  anchors.right: closeButton.left
  anchors.top: parent.top
  height: parent.height/2
}
#+END_SRC

** Layouts

- =ColumnLayout=, =RowLayout=, =GridLayout=
- Simpler to use
- Handle arbitrary number of Widgets

#+BEGIN_SRC js
import QtQuick.Layouts 1.2

ColumnLayout {
  Text {text: "Top"}
  Text {text: "Middle"}
  Text {text: "Bottom"}
}j
#+END_SRC

** Containers

#+Name:HelloContainer
#+BEGIN_SRC js :noweb yes
Rectangle {
  width: 600
  height: 600
  color: "green"
  <<HelloTextWidget>>
}
#+END_SRC

** Python Loading

Now we need to write some python to actually display the QML file

#+BEGIN_SRC python :tangle hello/main.py :noweb yes
from PySide2.QtQuick import QQuickView
<<QApplicationCreate>>
<<QQuickView>>
<<QApplicationRun>>
#+END_SRC

** QApplication

- Handles the busywork of running a GUI (e.g. managing event loop)
- Takes a set of command line arguments
  - Better integration into user environment
  - Enable visually impaired users to customise display

#+Name: QApplicationCreate
#+BEGIN_SRC python
from PySide2.QtWidgets import QApplication
import sys

app = QApplication(sys.argv)
#+END_SRC

Use the =exec_= method to start the application

#+Name: QApplicationRun
#+BEGIN_SRC python
app.exec_()
#+END_SRC


** QQuickView

- Handles the display of the QML file
- =setSource= picks the file
- Must `show` the view for it to appear on screen

#+Name: QQuickView
#+BEGIN_SRC python
view = QQuickView()
view.setSource("view.qml")
view.show()
#+END_SRC

** Exercises

- Change the background to a less garish colour
- Give a more personal greeting

* Compute Stats

