slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>QML Tutorial</title>
<meta name="author" content="Adam Washington"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">QML Tutorial</h1><p class="subtitle">Better GUI with less effort</p>
<h2 class="author">Adam Washington</h2><h2 class="date">2023-06-28</h2><p class="date">Created: 2023-06-27 Tue 14:40</p>
</section>

<section>
<section id="slide-org9777358">
<h2 id="org9777358"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-org0893e96">
<h3 id="org0893e96"><span class="section-number-3">1.1.</span> QML</h3>
<ul>
<li>A declarative method for defining GUIs</li>
<li>Based on the Qt library</li>
<li>Supports <a href="https://wiki.qt.io/Language_Bindings">over a dozen languages</a>.</li>
<li>Declarative GUI, not imperative</li>
<li>Divides code into a <code>model</code> and a <code>view</code></li>

</ul>

<ol class="org-ol">
<li><a id="org821f15c"></a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="B_note">B_note</span></span><br />
<p>
This repo is a tutorial set for understanding using QML with Python
for creating GUIs.  Python was chosen due to its status as a modern
<i>lingua franca</i> of coding, but the concepts apply to <a href="https://wiki.qt.io/Language_Bindings">over a dozen
languages</a>.  In fact, the QML files allows changing the backend
implementation language without making any changes to the interface.
</p>

<p>
Through a series of alternating sections, we'll create a small data
analysis application.  We will attempt to alternate making changes to
the python and the QML to help emphasise the separation.
</p>
</li>
</ol>

</section>
<section id="slide-org57bff9a">
<h3 id="org57bff9a"><span class="section-number-3">1.2.</span> Model</h3>
<ul>
<li>Performs detailed language and calculations</li>
<li>Written in your favourite programming language</li>
<li>Has <b>no knowledge</b> of the screen or window</li>
<li>Only acts via <code>Properties</code>, <code>Signals</code>, and <code>Slots</code></li>

</ul>

</section>
<section id="slide-org1707d62">
<h3 id="org1707d62"><span class="section-number-3">1.3.</span> Vocab</h3>
<p>
The Qt object model has a couple of pieces of vocab
</p>

<dl>
<dt>Signal</dt><dd>A message which may trigger actions from multiple parts of the application</dd>
<dt>Slot</dt><dd>A routine that can be performed.  Can be connected to a signal</dd>
<dt>Property</dt><dd>A value that can be read and optionally written.  May emit a signal when changed.</dd>

</dl>

</section>
<section id="slide-org3676935">
<h3 id="org3676935"><span class="section-number-3">1.4.</span> View</h3>
<ul>
<li>Describes the on screen display of the model</li>
<li>Always written in QML</li>
<li>Used to connect the Properties, Signals, and Slots of the models</li>

</ul>

</section>
<section id="slide-orgc5f2cfa">
<h3 id="orgc5f2cfa"><span class="section-number-3">1.5.</span> Why Bother?</h3>
<ul>
<li>Code reuse
<ul>
<li>A model can have multiple views</li>
<li>A view can apply to multiple models</li>

</ul></li>
<li>Makes code easy to test</li>
<li>Less bugs</li>
<li>Shorter, more readable code</li>
<li>No name litter</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgb11557e">
<h2 id="orgb11557e"><span class="section-number-2">2.</span> Hello World</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
<section id="slide-org454a94b">
<h3 id="org454a94b"><span class="section-number-3">2.1.</span> Full Text</h3>
<p>
We'll start with the simplest possible QML example.
</p>

<div class="org-src-container">

<pre  class="src src-js"   ><code trim><span style="color: #e392ff;">import</span> QtQuick 2.0

Rectangle <span style="color: #e392ff;">{</span>
  width: 200
  height: 200
  color: <span style="color: #00d4b2;">"green"</span>
  Text <span style="color: #00bcff;">{</span>
    text: <span style="color: #00d4b2;">"Hello World!"</span>
    anchors.centerIn: parent
  <span style="color: #00bcff;">}</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgf9aac1a">
<h3 id="orgf9aac1a"><span class="section-number-3">2.2.</span> Imports</h3>
<div class="org-src-container">

<pre  class="src src-js" id="SimpleQMLImport"  ><code trim><span style="color: #e392ff;">import</span> QtQuick 2.0
</code></pre>
</div>

<p>
Every QML file starts with a set of imports.  You will always need to
import `QtQuick`, as it is the default QML library.  We'll encounter
more libraries as we continue.
</p>

</section>
<section id="slide-org774235c">
<h3 id="org774235c"><span class="section-number-3">2.3.</span> Widgets</h3>
<div class="org-src-container">

<pre  class="src src-js" id="HelloTextWidget"  ><code trim>Text <span style="color: #e392ff;">{</span>
  text: <span style="color: #00d4b2;">"Hello World!"</span>
  anchors.centerIn: parent
<span style="color: #e392ff;">}</span>
</code></pre>
</div>


<ul>
<li>Widget type followed by curly bracket</li>
<li>Attribute name, then colon, then value</li>

</ul>


</section>
<section id="slide-orgdbc0b18">
<h3 id="orgdbc0b18"><span class="section-number-3">2.4.</span> Anchors</h3>
<ul>
<li>Describe constraints between edges of widgets</li>
<li>Full control of positioning</li>
<li>Lots of work</li>

</ul>

<div class="org-src-container">

<pre  class="src src-js"   ><code trim>Button <span style="color: #e392ff;">{</span>
  anchors.left: parent.left
  anchors.right: closeButton.left
  anchors.top: parent.top
  height: parent.height/2
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org1befce7">
<h3 id="org1befce7"><span class="section-number-3">2.5.</span> Layouts</h3>
<ul>
<li><code>ColumnLayout</code>, <code>RowLayout</code>, <code>GridLayout</code></li>
<li>Simpler to use</li>
<li>Handle arbitrary number of Widgets</li>

</ul>

<div class="org-src-container">

<pre  class="src src-js"   ><code trim><span style="color: #e392ff;">import</span> QtQuick.Layouts 1.2

ColumnLayout <span style="color: #e392ff;">{</span>
  Text <span style="color: #00bcff;">{</span>text: <span style="color: #00d4b2;">"Top"</span><span style="color: #00bcff;">}</span>
  Text <span style="color: #00bcff;">{</span>text: <span style="color: #00d4b2;">"Middle"</span><span style="color: #00bcff;">}</span>
  Text <span style="color: #00bcff;">{</span>text: <span style="color: #00d4b2;">"Bottom"</span><span style="color: #00bcff;">}</span>
<span style="color: #e392ff;">}</span>j
</code></pre>
</div>

</section>
<section id="slide-orgc028cf1">
<h3 id="orgc028cf1"><span class="section-number-3">2.6.</span> Containers</h3>
<div class="org-src-container">

<pre  class="src src-js" id="HelloContainer"  ><code trim>Rectangle <span style="color: #e392ff;">{</span>
  width: 200
  height: 200
  color: <span style="color: #00d4b2;">"green"</span>
  Text <span style="color: #00bcff;">{</span>
    text: <span style="color: #00d4b2;">"Hello World!"</span>
    anchors.centerIn: parent
  <span style="color: #00bcff;">}</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org8ae3a7c">
<h3 id="org8ae3a7c"><span class="section-number-3">2.7.</span> Python Loading</h3>
<p>
Now we need to write some python to actually display the QML file
</p>

<div class="org-src-container">

<pre  class="src src-python"   ><code trim><span style="color: #e392ff;">from</span> PySide2.QtQuick <span style="color: #e392ff;">import</span> QQuickView
<span style="color: #e392ff;">from</span> PySide2.QtWidgets <span style="color: #e392ff;">import</span> QApplication
<span style="color: #e392ff;">import</span> sys

<span style="color: #ff8754;">app</span> = QApplication<span style="color: #e392ff;">(</span>sys.argv<span style="color: #e392ff;">)</span>
<span style="color: #ff8754;">view</span> = QQuickView<span style="color: #e392ff;">()</span>
view.setSource<span style="color: #e392ff;">(</span><span style="color: #00d4b2;">"view.qml"</span><span style="color: #e392ff;">)</span>
view.show<span style="color: #e392ff;">()</span>
app.exec_<span style="color: #e392ff;">()</span>
</code></pre>
</div>

</section>
<section id="slide-org39f487f">
<h3 id="org39f487f"><span class="section-number-3">2.8.</span> QApplication</h3>
<ul>
<li>Handles the busywork of running a GUI (e.g. managing event loop)</li>
<li>Takes a set of command line arguments
<ul>
<li>Better integration into user environment</li>
<li>Enable visually impaired users to customise display</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre  class="src src-python" id="QApplicationCreate"  ><code trim><span style="color: #e392ff;">from</span> PySide2.QtWidgets <span style="color: #e392ff;">import</span> QApplication
<span style="color: #e392ff;">import</span> sys

<span style="color: #ff8754;">app</span> = QApplication<span style="color: #e392ff;">(</span>sys.argv<span style="color: #e392ff;">)</span>
</code></pre>
</div>

<p>
Use the <code>exec_</code> method to start the application
</p>

<div class="org-src-container">

<pre  class="src src-python" id="QApplicationRun"  ><code trim>app.exec_<span style="color: #e392ff;">()</span>
</code></pre>
</div>


</section>
<section id="slide-org4fea364">
<h3 id="org4fea364"><span class="section-number-3">2.9.</span> QQuickView</h3>
<ul>
<li>Handles the display of the QML file</li>
<li><code>setSource</code> picks the file</li>
<li>Must `show` the view for it to appear on screen</li>

</ul>

<div class="org-src-container">

<pre  class="src src-python" id="QQuickView"  ><code trim><span style="color: #ff8754;">view</span> = QQuickView<span style="color: #e392ff;">()</span>
view.setSource<span style="color: #e392ff;">(</span><span style="color: #00d4b2;">"view.qml"</span><span style="color: #e392ff;">)</span>
view.show<span style="color: #e392ff;">()</span>
</code></pre>
</div>

</section>
<section id="slide-org186593f">
<h3 id="org186593f"><span class="section-number-3">2.10.</span> Exercises</h3>
<ul>
<li>Change the background to a less garish colour</li>
<li>Give a more personal greeting</li>

</ul>

</section>
</section>
