slides.org
** Model

We introduce our first data model class.

#+BEGIN_SRC python :tangle stats/model.py :noweb yes
import numpy as np
from PySide2.QtCore import QObject, Property
from PySide2.QtQml import QQmlApplicationEngine, qmlRegisterType
class Stats(QObject):
  _data = None
  def __init__(self):
        QObject.__init__(self)
        self.data_ = np.loadtxt("data.txt")
  <<PropertyFloat>>
  def x_mean(self):
        return np.mean(self.data_[:, 0])
  <<PropertyFloat>>
  def y_mean(self):
        return np.mean(self.data_[:, 1])
<<QmlRegisterType>>
#+END_SRC

#+BEGIN_SRC python :tangle stats/main.py :noweb yes :exports none
from PySide2.QtQuick import QQuickView
import model
<<QApplicationCreate>>
<<QQuickView>>
<<QApplicationRun>>
#+END_SRC

** qmlRegisterType

#+NAME: QmlRegisterType
#+BEGIN_SRC js
qmlRegisterType(Stats, "Tutorial", 1, 0, "Stats")
#+END_SRC

- Make python data accessible in QML
- Can only be performed on classes that inherit from QObject

** Property

#+NAME: PropertyFloat
#+BEGIN_SRC python
@Property(float)
#+END_SRC

- Makes class data accessible from QML
- Tells QML that the value is a =float=
- Accessible by the function name

** Data View

#+BEGIN_SRC js :tangle stats/view.qml :noweb yes
import QtQuick 2.0
<<TutorialImport>>

Rectangle {
  width: 600
  height: 600
  color: "#F0F0F0"
  <<LoadStats>>
  Text {
        <<ViewStats>>
        anchors.centerIn: parent
  }
}
#+END_SRC

** Tutorial Import

#+NAME: TutorialImport
#+BEGIN_SRC js
import Tutorial 1.0
#+END_SRC

Import the QML type that we declared earlier

** Load Stats

Create an instance of the stats object we defined earlier

#+NAME: LoadStats
#+BEGIN_SRC js
Stats {id: myStats;}
#+END_SRC

Add am instance of the =Stats= class we created to our application

#+NAME: ViewStats
#+BEGIN_SRC js
text: myStats.x_mean + ", " + myStats.y_mean
#+END_SRC

** Exercises

- Create a new property to display the sum of the columns

* Display

** Create a Header

We're going to add some header text to our window

#+Name: DisplayHeader
#+BEGIN_SRC js
Text {
  id: titleText
  text: "Stat Calculator"
  anchors.top: parent.top
  anchors.horizontalCenter: parent.horizontalCenter
}
#+END_SRC

** Data Display

We'll now display the x and y mean in a grid, instead of just a single label

#+Name: DisplayContent
#+BEGIN_SRC js
GridLayout {
  anchors.top: titleText.bottom
  anchors.bottom: parent.bottom
  anchors.left: parent.left
  anchors.right: parent.right

  columns: 2

  Text {text: "X mean"}
  Text {text: myStats.x_mean}
  Text {text: "Y mean"}
  Text {text: myStats.y_mean}
}
#+END_SRC

This also requires that we import

#+BEGIN_SRC js
import QtQuick.Layouts 1.2
#+END_SRC

#+BEGIN_SRC js :tangle display/view.qml :exports none :noweb yes
import QtQuick 2.0
import QtQuick.Layouts 1.2
import Tutorial 1.0

Rectangle {
  width: 600
  height: 600
  color: "#F0F0F0"

  Stats {
        id: myStats
  }

  <<DisplayHeader>>

  <<DisplayContent>>
}
#+END_SRC

** Exercises

- Put the X and Y means on the same row
- Move the title to the bottom of the window
- Move the title to the left side of the window
- Remove the GridLayout and layout the entire window with anchors (this will be tedious).

* Filename

** Signal

Allow the model to load any data file we want.  First, we'll need to
add a signal that will emit when the file name is changed.  (This will
be more important later).

#+NAME: FilenameSignal
#+BEGIN_SRC js
dataChanged = Signal()
#+END_SRC

** Filename Property

We now need to add a property for the file name.  The expanded
=Property= tag tells the model to update the property's value every
time the =dataChanged= signal is emitted.

#+NAME: FilenameGetter
#+BEGIN_SRC python
@Property(QUrl, notify=dataChanged)
def filename(self):
        """ The name of the data file """
        return self._filename
#+END_SRC

We'll also want to update the =Property= decorator for the other
properties to update them when the data is changed.

