slides.html
<section>
<section id="slide-orgf47de81">
<h2 id="orgf47de81"><span class="section-number-2">3.</span> Compute Stats</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
<section id="slide-orgc571aa2">
<h3 id="orgc571aa2"><span class="section-number-3">3.1.</span> Model</h3>
<p>
We introduce our first data model class.
</p>

<div class="org-src-container">

<pre  class="src src-python"   ><code trim><span style="color: #e392ff;">import</span> numpy <span style="color: #e392ff;">as</span> np
<span style="color: #e392ff;">from</span> PySide2.QtCore <span style="color: #e392ff;">import</span> QObject, Property
<span style="color: #e392ff;">from</span> PySide2.QtQml <span style="color: #e392ff;">import</span> QQmlApplicationEngine, qmlRegisterType
<span style="color: #e392ff;">class</span> <span style="color: #64ca4b;">Stats</span><span style="color: #e392ff;">(</span>QObject<span style="color: #e392ff;">)</span>:
  <span style="color: #ff8754;">_data</span> = <span style="color: #d6b104;">None</span>
  <span style="color: #e392ff;">def</span> <span style="color: #00bcff;">__init__</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span><span style="color: #e392ff;">)</span>:
        QObject.__init__<span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span><span style="color: #e392ff;">)</span>
        <span style="color: #e392ff;">self</span>.<span style="color: #ff8754;">data_</span> = np.loadtxt<span style="color: #e392ff;">(</span><span style="color: #00d4b2;">"data.txt"</span><span style="color: #e392ff;">)</span>
  <span style="color: #64ca4b;">@Property</span><span style="color: #e392ff;">(</span><span style="color: #00d1ff;">float</span><span style="color: #e392ff;">)</span>
  <span style="color: #e392ff;">def</span> <span style="color: #00bcff;">x_mean</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span><span style="color: #e392ff;">)</span>:
        <span style="color: #e392ff;">return</span> np.mean<span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>.data_<span style="color: #00bcff;">[</span>:, 0<span style="color: #00bcff;">]</span><span style="color: #e392ff;">)</span>
  <span style="color: #64ca4b;">@Property</span><span style="color: #e392ff;">(</span><span style="color: #00d1ff;">float</span><span style="color: #e392ff;">)</span>
  <span style="color: #e392ff;">def</span> <span style="color: #00bcff;">y_mean</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span><span style="color: #e392ff;">)</span>:
        <span style="color: #e392ff;">return</span> np.mean<span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>.data_<span style="color: #00bcff;">[</span>:, 1<span style="color: #00bcff;">]</span><span style="color: #e392ff;">)</span>
qmlRegisterType<span style="color: #e392ff;">(</span>Stats, <span style="color: #00d4b2;">"Tutorial"</span>, 1, 0, <span style="color: #00d4b2;">"Stats"</span><span style="color: #e392ff;">)</span>
</code></pre>
</div>

</section>
<section id="slide-org7a1a29e">
<h3 id="org7a1a29e"><span class="section-number-3">3.2.</span> qmlRegisterType</h3>
<div class="org-src-container">

<pre  class="src src-js" id="QmlRegisterType"  ><code trim>qmlRegisterType<span style="color: #e392ff;">(</span>Stats, <span style="color: #00d4b2;">"Tutorial"</span>, 1, 0, <span style="color: #00d4b2;">"Stats"</span><span style="color: #e392ff;">)</span>
</code></pre>
</div>

<ul>
<li>Make python data accessible in QML</li>
<li>Can only be performed on classes that inherit from QObject</li>

</ul>

</section>
<section id="slide-orgb665a57">
<h3 id="orgb665a57"><span class="section-number-3">3.3.</span> Property</h3>
<div class="org-src-container">

<pre  class="src src-python" id="PropertyFloat"  ><code trim><span style="color: #64ca4b;">@Property</span><span style="color: #e392ff;">(</span><span style="color: #00d1ff;">float</span><span style="color: #e392ff;">)</span>
</code></pre>
</div>

<ul>
<li>Makes class data accessible from QML</li>
<li>Tells QML that the value is a <code>float</code></li>
<li>Accessible by the function name</li>

</ul>

</section>
<section id="slide-org6928a6e">
<h3 id="org6928a6e"><span class="section-number-3">3.4.</span> Data View</h3>
<div class="org-src-container">

<pre  class="src src-js"   ><code trim><span style="color: #e392ff;">import</span> QtQuick 2.0
<span style="color: #e392ff;">import</span> Tutorial 1.0

Rectangle <span style="color: #e392ff;">{</span>
  width: 200
  height: 200
  color: <span style="color: #00d4b2;">"#F0F0F0"</span>
  Stats <span style="color: #00bcff;">{</span>id: myStats;<span style="color: #00bcff;">}</span>
  Text <span style="color: #00bcff;">{</span>
        text: myStats.x_mean + <span style="color: #00d4b2;">", "</span> + myStats.y_mean
        anchors.centerIn: parent
  <span style="color: #00bcff;">}</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org57ce947">
<h3 id="org57ce947"><span class="section-number-3">3.5.</span> Tutorial Import</h3>
<div class="org-src-container">

<pre  class="src src-js" id="TutorialImport"  ><code trim><span style="color: #e392ff;">import</span> Tutorial 1.0
</code></pre>
</div>

<p>
Import the QML type that we declared earlier
</p>

</section>
<section id="slide-orgfb0e384">
<h3 id="orgfb0e384"><span class="section-number-3">3.6.</span> Load Stats</h3>
<p>
Create an instance of the stats object we defined earlier
</p>

<div class="org-src-container">

<pre  class="src src-js" id="LoadStats"  ><code trim>Stats <span style="color: #e392ff;">{</span>id: myStats;<span style="color: #e392ff;">}</span>
</code></pre>
</div>

<p>
Add am instance of the <code>Stats</code> class we created to our application
</p>

<div class="org-src-container">

<pre  class="src src-js" id="ViewStats"  ><code trim>text: myStats.x_mean + <span style="color: #00d4b2;">", "</span> + myStats.y_mean
</code></pre>
</div>

</section>
<section id="slide-orgce88413">
<h3 id="orgce88413"><span class="section-number-3">3.7.</span> Exercises</h3>
<ul>
<li>Create a new property to display the sum of the columns</li>

</ul>

</section>
</section>
<section>
<section id="slide-org1b4c77a">
<h2 id="org1b4c77a"><span class="section-number-2">4.</span> Display</h2>
<div class="outline-text-2" id="text-4">
</div>
</section>
<section id="slide-orgd7a2b35">
<h3 id="orgd7a2b35"><span class="section-number-3">4.1.</span> Create a Header</h3>
<p>
We're going to add some header text to our window
</p>

<div class="org-src-container">

<pre  class="src src-js" id="DisplayHeader"  ><code trim>Text <span style="color: #e392ff;">{</span>
  id: titleText
  text: <span style="color: #00d4b2;">"Stat Calculator"</span>
  anchors.top: parent.top
  anchors.horizontalCenter: parent.horizontalCenter
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgfe458fd">
<h3 id="orgfe458fd"><span class="section-number-3">4.2.</span> Data Display</h3>
<p>
We'll now display the x and y mean in a grid, instead of just a single label
</p>

<div class="org-src-container">

<pre  class="src src-js" id="DisplayContent"  ><code trim>GridLayout <span style="color: #e392ff;">{</span>
  anchors.top: titleText.bottom
  anchors.bottom: parent.bottom
  anchors.left: parent.left
  anchors.right: parent.right

  columns: 2

  Text <span style="color: #00bcff;">{</span>text: <span style="color: #00d4b2;">"X mean"</span><span style="color: #00bcff;">}</span>
  Text <span style="color: #00bcff;">{</span>text: myStats.x_mean<span style="color: #00bcff;">}</span>
  Text <span style="color: #00bcff;">{</span>text: <span style="color: #00d4b2;">"Y mean"</span><span style="color: #00bcff;">}</span>
  Text <span style="color: #00bcff;">{</span>text: myStats.y_mean<span style="color: #00bcff;">}</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

<p>
This also requires that we import <code>QtQuick.Layouts 1.2</code>
</p>

</section>
<section id="slide-org5f930ea">
<h3 id="org5f930ea"><span class="section-number-3">4.3.</span> Exercises</h3>
<ul>
<li>Put the X and Y means on the same row</li>
<li>Move the title to the bottom of the window</li>
<li>Move the title to the left side of the window</li>
<li>Remove the GridLayout and layout the entire window with anchors (this will be tedious).</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgd9ed7e7">
<h2 id="orgd9ed7e7"><span class="section-number-2">5.</span> Filename</h2>
<div class="outline-text-2" id="text-5">
</div>
</section>
<section id="slide-orgd3135e5">
<h3 id="orgd3135e5"><span class="section-number-3">5.1.</span> Signal</h3>
<p>
Allow the model to load any data file we want.  First, we'll need to
add a signal that will emit when the file name is changed.  (This will
be more important later).
</p>

<div class="org-src-container">

<pre  class="src src-js" id="FilenameSignal"  ><code trim>dataChanged = Signal<span style="color: #e392ff;">()</span>
</code></pre>
</div>

</section>
<section id="slide-org7056aa6">
<h3 id="org7056aa6"><span class="section-number-3">5.2.</span> Filename Property</h3>
<p>
We now need to add a property for the file name.  The expanded
<code>Property</code> tag tells the model to update the property's value every
time the <code>dataChanged</code> signal is emitted.
</p>

<div class="org-src-container">

<pre  class="src src-python" id="FilenameGetter"  ><code trim><span style="color: #64ca4b;">@Property</span><span style="color: #e392ff;">(</span><span style="color: #00d1ff;">str</span>, notify=dataChanged<span style="color: #e392ff;">)</span>
<span style="color: #e392ff;">def</span> <span style="color: #00bcff;">filename</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span><span style="color: #e392ff;">)</span>:
        <span style="color: #dfbea6;">""" The name of the data file """</span>
        <span style="color: #e392ff;">return</span> <span style="color: #e392ff;">self</span>._filename
</code></pre>
</div>

<p>
We'll also want to update the <code>Property</code> decorator for the other
properties to update them when the data is changed.
</p>

</section>
