slides.org
** Filename Setter

We're going to add our first property setter.  It's like the getter,
but takes an extra parameter for the new value.  We emit the
=dataChanged= signal at the end to indicate that the data has changed.

#+NAME: FilenameSetter
#+BEGIN_SRC python
@filename.setter
def filename(self, name):
        """ Load a new data file """
        self._filename = name
        self._data = np.loadtxt(name.toLocalFile())
        self.dataChanged.emit()
#+END_SRC

#+BEGIN_SRC python :tangle filename/model.py :noweb yes :exports none
import numpy as np
from PySide2.QtCore import QObject, Property, Signal, QUrl
from PySide2.QtQml import QQmlApplicationEngine, qmlRegisterType

class Stats(QObject):
        _data = None # The numbers to calculate over
        _filename = "";

        def __init__(self):
            """ Create the Stats object """
            QObject.__init__(self)

        <<FilenameSignal>>

        <<FilenameGetter>>

        <<FilenameSetter>>

        @Property(float, notify=dataChanged)
        def x_mean(self):
            """ The mean of the first column """
            if self._data is None:
                    return 0
            return np.mean(self._data[:, 0])

        @Property(float, notify=dataChanged)
        def y_mean(self):
            """ The mean of the second column """
            if self._data is None:
                    return 0
            return np.mean(self._data[:, 1])

qmlRegisterType(Stats, "Tutorial", 1, 0, "Stats")
#+END_SRC

** Update View

Since the model now picks the file through the =filename= property, we
need to update the view to pick a file.

#+NAME: FilenameStats
#+BEGIN_SRC js
Stats {
  id: myStats
  filename: "file:data.txt"
}
#+END_SRC

#+BEGIN_SRC js :tangle filename/view.qml :noweb yes :exports none
import QtQuick 2.0
import QtQuick.Layouts 1.2
import Tutorial 1.0

Rectangle {
  width: 600
  height: 600
  color: "#F0F0F0"

  <<FilenameStats>>

  <<DisplayHeader>>

  <<DisplayContent>>
}

#+END_SRC

** Exercises

- Set title text to the name of the data file

* Interactive

** Interactivity

After all this time, we'll finally add a truly interactive component.
Specifically, we'll add a =FileDialog= to the view to set the data
file.

#+NAME: FileDialog
#+BEGIN_SRC js
FileDialog {
  id: fileDialog
  title: "Choose a data file"
  onAccepted: myStats.filename = fileDialog.fileUrl
}
#+END_SRC

** Button

We have the file dialog, but we need a button to trigger the dialog

#+NAME: FileButton
#+BEGIN_SRC js
Button {
        id: loadButton
        anchors.top: titleText.bottom
        anchors.left: parent.left
        anchors.right: parent.right
        text: "Load file"
        onClicked: fileDialog.open()
}
#+END_SRC

#+BEGIN_SRC js :tangle interactive/view.qml :noweb yes :exports none
import QtQuick 2.0
import QtQuick.Controls 2.15
import QtQuick.Dialogs 1.3
import QtQuick.Layouts 1.2
import Tutorial 1.0

Rectangle {
  width: 600
  height: 600
  color: "#F0F0F0"

  <<FilenameStats>>

  <<FileDialog>>

  <<DisplayHeader>>

  <<FileButton>>

  <<DisplayContent>>
}
#+END_SRC

** Exercises

- Using the =console.log= slot, bind to the =dataChanged= signal on
  the =Stats= model and print the file name to the console every time
  the data changes.
- Find a better position for the file dialog button.
- Create a bool property on the Stats model that explains whether a
  file has been loaded.

* Display Tables

** QAbstractTableModel

- Thus far, every model that we've build has been based on QObject
- Special Subclasses for advanced data
  - QAbstractListModel :: Used for 1D data
  - QAbstractTableModel :: Used for 2D data
  - QAbstractItemModel :: Used for Tree Data

** Mandataory Overloads

- rowCount() :: Number of data elements
- columnCount() :: Number of properties on elements
- data(index, role) :: Access an element by index

** Recommended Overloads

- headerData(section, orientation, role) :: Column headers
- setData(index, value, role) :: Update an element by index
- flags(index) :: Metadata for an element

For our example app, we will not need these.

** Add Count Overloads

#+NAME: RowColumnCount
#+BEGIN_SRC python
@Slot()
def rowCount(self, parent):
    if self._data is None:
        return 0
    return self._data.shape[0]

@Slot()
def columnCount(self, parent):
    if self._data is None:
        return 0
    return self._data.shape[1]
#+END_SRC

** Add Data Overloads

#+NAME: TableData
#+BEGIN_SRC python
@Slot()
def data(self, index, role):
    if self._data is None:
        return None
    return float(self._data[index.row(),
                            index.column()])
#+END_SRC

** Signals

Just like other properties, the abstract models need signals to inform
the view of changes.  Thankfully, the class provides a series of
helper functions.

#+NAME: ResetModel
#+BEGIN_SRC python
@filename.setter
def filename(self, name):
    """ Load a new data file """
    self._filename = name
    self.beginResetModel()
    self._data = np.loadtxt(name.toLocalFile())
    self.endResetModel()
    self.dataChanged.emit()
#+END_SRC

#+BEGIN_SRC python :tangle table/model.py :noweb yes :exports none
import numpy as np
from PySide2.QtCore import Property, Signal, Slot, QAbstractTableModel, QUrl
from PySide2.QtQml import QQmlApplicationEngine, qmlRegisterType

class Stats(QAbstractTableModel):
        _data = None # The numbers to calculate over
        _filename = "";

        def __init__(self):
                """ Create the Stats object """
                QAbstractTableModel.__init__(self)

        <<FilenameSignal>>

        <<RowColumnCount>>

        <<TableData>>

        dataChanged = Signal()

        <<FilenameGetter>>

        <<ResetModel>>

        @Property(float, notify=dataChanged)
        def x_mean(self):
                """ The mean of the first column """
                if self._data is None:
                        return 0
                return np.mean(self._data[:, 0])

        @Property(float, notify=dataChanged)
        def y_mean(self):
                """ The mean of the second column """
                if self._data is None:
                        return 0
                return np.mean(self._data[:, 1])

qmlRegisterType(Stats, "Tutorial", 1, 0, "Stats")
#+END_SRC

