slides.html
<section id="slide-orgd0a5821">
<h3 id="orgd0a5821"><span class="section-number-3">5.3.</span> Filename Setter</h3>
<p>
We're going to add our first property setter.  It's like the getter,
but takes an extra parameter for the new value.  We emit the
<code>dataChanged</code> signal at the end to indicate that the data has changed.
</p>

<div class="org-src-container">

<pre  class="src src-python" id="FilenameSetter"  ><code trim><span style="color: #64ca4b;">@filename.setter</span>
<span style="color: #e392ff;">def</span> <span style="color: #00bcff;">filename</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>, name<span style="color: #e392ff;">)</span>:
        <span style="color: #dfbea6;">""" Load a new data file """</span>
        <span style="color: #e392ff;">self</span>.<span style="color: #ff8754;">_filename</span> = name
        <span style="color: #e392ff;">self</span>.<span style="color: #ff8754;">_data</span> = np.loadtxt<span style="color: #e392ff;">(</span>name<span style="color: #e392ff;">)</span>
        <span style="color: #e392ff;">self</span>.dataChanged.emit<span style="color: #e392ff;">()</span>
</code></pre>
</div>

</section>
<section id="slide-orgbad75eb">
<h3 id="orgbad75eb"><span class="section-number-3">5.4.</span> Update View</h3>
<p>
Since the model now picks the file through the <code>filename</code> property, we
need to update the view to pick a file.
</p>

<div class="org-src-container">

<pre  class="src src-js" id="FilenameStats"  ><code trim>Stats <span style="color: #e392ff;">{</span>
  id: myStats
  filename: <span style="color: #00d4b2;">"data.txt"</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org28ffb61">
<h3 id="org28ffb61"><span class="section-number-3">5.5.</span> Exercises</h3>
<ul>
<li>Set title text to the name of the data file</li>

</ul>

</section>
</section>
<section>
<section id="slide-org171d07d">
<h2 id="org171d07d"><span class="section-number-2">6.</span> Interactive</h2>
<div class="outline-text-2" id="text-6">
</div>
</section>
<section id="slide-org091f909">
<h3 id="org091f909"><span class="section-number-3">6.1.</span> Interactivity</h3>
<p>
After all this time, we'll finally add a truly interactive component.
Specifically, we'll add a <code>FileDialog</code> to the view to set the data
file.
</p>

<div class="org-src-container">

<pre  class="src src-js" id="FileDialog"  ><code trim>FileDialog <span style="color: #e392ff;">{</span>
  id: fileDialog
  title: <span style="color: #00d4b2;">"Choose a data file"</span>
  onAccepted: myStats.filename = fileDialog.fileUrl.toString<span style="color: #00bcff;">()</span>.substring<span style="color: #00bcff;">(</span>7<span style="color: #00bcff;">)</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgb182eac">
<h3 id="orgb182eac"><span class="section-number-3">6.2.</span> Button</h3>
<p>
We have the file dialog, but we need a button to trigger the dialog
</p>

<div class="org-src-container">

<pre  class="src src-js" id="FileButton"  ><code trim>Button <span style="color: #e392ff;">{</span>
        id: loadButton
        anchors.top: titleText.bottom
        anchors.left: parent.left
        anchors.right: parent.right
        text: <span style="color: #00d4b2;">"Load file"</span>
        onClicked: fileDialog.open<span style="color: #00bcff;">()</span>
<span style="color: #e392ff;">}</span>
</code></pre>
</div>

</section>
<section id="slide-orgdbba2e6">
<h3 id="orgdbba2e6"><span class="section-number-3">6.3.</span> Exercises</h3>
<ul>
<li>Using the <code>console.log</code> slot, bind to the <code>dataChanged</code> signal on
the <code>Stats</code> model and print the file name to the console every time
the data changes.</li>
<li>Find a better position for the file dialog button.</li>
<li>Create a bool property on the Stats model that explains whether a
file has been loaded.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orge9a34ad">
<h2 id="orge9a34ad"><span class="section-number-2">7.</span> Display Tables</h2>
<div class="outline-text-2" id="text-7">
</div>
</section>
<section id="slide-orge93352d">
<h3 id="orge93352d"><span class="section-number-3">7.1.</span> QAbstractTableModel</h3>
<ul>
<li>Thus far, every model that we've build has been based on QObject</li>
<li>Special Subclasses for advanced data
<dl>
<dt>QAbstractListModel</dt><dd>Used for 1D data</dd>
<dt>QAbstractTableModel</dt><dd>Used for 2D data</dd>
<dt>QAbstractItemModel</dt><dd>Used for Tree Data</dd>

</dl></li>

</ul>

</section>
<section id="slide-org728df4d">
<h3 id="org728df4d"><span class="section-number-3">7.2.</span> Mandataory Overloads</h3>
<dl>
<dt>rowCount()</dt><dd>Number of data elements</dd>
<dt>columnCount()</dt><dd>Number of properties on elements</dd>
<dt>data(index, role)</dt><dd>Access an element by index</dd>

</dl>

</section>
<section id="slide-org58430ee">
<h3 id="org58430ee"><span class="section-number-3">7.3.</span> Recommended Overloads</h3>
<dl>
<dt>headerData(section, orientation, role)</dt><dd>Column headers</dd>
<dt>setData(index, value, role)</dt><dd>Update an element by index</dd>
<dt>flags(index)</dt><dd>Metadata for an element</dd>

</dl>

<p>
For our example app, we will not need these.
</p>

</section>
<section id="slide-orgea74621">
<h3 id="orgea74621"><span class="section-number-3">7.4.</span> Add Count Overloads</h3>
<div class="org-src-container">

<pre  class="src src-python" id="RowColumnCount"  ><code trim><span style="color: #64ca4b;">@Slot</span><span style="color: #e392ff;">()</span>
<span style="color: #e392ff;">def</span> <span style="color: #00bcff;">rowCount</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>, parent<span style="color: #e392ff;">)</span>:
        <span style="color: #e392ff;">if</span> <span style="color: #e392ff;">self</span>._data <span style="color: #e392ff;">is</span> <span style="color: #d6b104;">None</span>:
        <span style="color: #e392ff;">return</span> 0
        <span style="color: #e392ff;">return</span> <span style="color: #e392ff;">self</span>._data.shape<span style="color: #e392ff;">[</span>0<span style="color: #e392ff;">]</span>

<span style="color: #64ca4b;">@Slot</span><span style="color: #e392ff;">()</span>
<span style="color: #e392ff;">def</span> <span style="color: #00bcff;">columnCount</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>, parent<span style="color: #e392ff;">)</span>:
        <span style="color: #e392ff;">if</span> <span style="color: #e392ff;">self</span>._data <span style="color: #e392ff;">is</span> <span style="color: #d6b104;">None</span>:
        <span style="color: #e392ff;">return</span> 0
        <span style="color: #e392ff;">return</span> <span style="color: #e392ff;">self</span>._data.shape<span style="color: #e392ff;">[</span>1<span style="color: #e392ff;">]</span>
</code></pre>
</div>

</section>
<section id="slide-org31b3319">
<h3 id="org31b3319"><span class="section-number-3">7.5.</span> Add Data Overloads</h3>
<div class="org-src-container">

<pre  class="src src-python" id="TableData"  ><code trim><span style="color: #64ca4b;">@Slot</span><span style="color: #e392ff;">()</span>
<span style="color: #e392ff;">def</span> <span style="color: #00bcff;">data</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>, index, role<span style="color: #e392ff;">)</span>:
        <span style="color: #e392ff;">if</span> <span style="color: #e392ff;">self</span>._data <span style="color: #e392ff;">is</span> <span style="color: #d6b104;">None</span>:
        <span style="color: #e392ff;">return</span> <span style="color: #d6b104;">None</span>
        <span style="color: #e392ff;">return</span> <span style="color: #00d1ff;">float</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>._data<span style="color: #00bcff;">[</span>index.row<span style="color: #00d1ff;">()</span>,
                                index.column<span style="color: #00d1ff;">()</span><span style="color: #00bcff;">]</span><span style="color: #e392ff;">)</span>
</code></pre>
</div>

</section>
<section id="slide-org0a9049b">
<h3 id="org0a9049b"><span class="section-number-3">7.6.</span> Signals</h3>
<p>
Just like other properties, the abstract models need signals to inform
the view of changes.  Thankfully, the class provides a series of
helper functions.
</p>

<div class="org-src-container">

<pre  class="src src-python" id="ResetModel"  ><code trim><span style="color: #64ca4b;">@filename.setter</span>
<span style="color: #e392ff;">def</span> <span style="color: #00bcff;">filename</span><span style="color: #e392ff;">(</span><span style="color: #e392ff;">self</span>, name<span style="color: #e392ff;">)</span>:
        <span style="color: #dfbea6;">""" Load a new data file """</span>
        <span style="color: #e392ff;">self</span>.<span style="color: #ff8754;">_filename</span> = name
        <span style="color: #e392ff;">self</span>.beginResetModel<span style="color: #e392ff;">()</span>
        <span style="color: #e392ff;">self</span>.<span style="color: #ff8754;">_data</span> = np.loadtxt<span style="color: #e392ff;">(</span>name<span style="color: #e392ff;">)</span>
        <span style="color: #e392ff;">self</span>.endResetModel<span style="color: #e392ff;">()</span>
        <span style="color: #e392ff;">self</span>.dataChanged.emit<span style="color: #e392ff;">()</span>
</code></pre>
</div>

</section>
